salatiel-arias-work/buildrsuac_module/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# BuildRS UAC
# ---------------
Atmel_SAMD21_XplainedPro_native.name=BuildRS UAC (Native USB Port)
Atmel_SAMD21_XplainedPro_native.vid.0=0x03eb
Atmel_SAMD21_XplainedPro_native.pid.0=0x6124
Atmel_SAMD21_XplainedPro_native.vid.1=0x2341
Atmel_SAMD21_XplainedPro_native.pid.1=0x004d
Atmel_SAMD21_XplainedPro_native.upload.tool=arduino:bossac
Atmel_SAMD21_XplainedPro_native.upload.protocol=sam-ba
Atmel_SAMD21_XplainedPro_native.upload.maximum_size=262144
Atmel_SAMD21_XplainedPro_native.upload.use_1200bps_touch=true
Atmel_SAMD21_XplainedPro_native.upload.wait_for_upload_port=true
Atmel_SAMD21_XplainedPro_native.upload.native_usb=true
Atmel_SAMD21_XplainedPro_native.build.mcu=cortex-m0plus
Atmel_SAMD21_XplainedPro_native.build.f_cpu=48000000L
Atmel_SAMD21_XplainedPro_native.build.usb_product="BuildRS UAC"
Atmel_SAMD21_XplainedPro_native.build.usb_manufacturer="ARRK Engineering GmbH"
Atmel_SAMD21_XplainedPro_native.build.board=BUILDRS_UAC
Atmel_SAMD21_XplainedPro_native.build.core=arduino:arduino
Atmel_SAMD21_XplainedPro_native.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags}
Atmel_SAMD21_XplainedPro_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
Atmel_SAMD21_XplainedPro_native.build.openocdscript=
Atmel_SAMD21_XplainedPro_native.build.variant=buildrs_uac
Atmel_SAMD21_XplainedPro_native.build.variant_system_lib=
Atmel_SAMD21_XplainedPro_native.build.vid=0x2341
Atmel_SAMD21_XplainedPro_native.build.pid=0x804d
